servicecontrollerservice_1.0.0.wsdl

<wsdl:definitions targetNamespace="http://www.thebank.com/schemas/CFX/" xmlns:apachesoap="http://xml.apache.org/xml-soap" xmlns:impl="http://www.thebank.com/schemas/CFX/" xmlns:intf="http://www.thebank.com/schemas/CFX/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
   <!--WSDL created by Apache Axis version: 1.3
Built on Oct 05, 2005 (05:23:37 EDT)-->
   <wsdl:types>
      <schema targetNamespace="http://www.thebank.com/schemas/CFX/" xmlns="http://www.w3.org/2001/XMLSchema">
         <element name="execute" type="xsd:string"/>
         <element name="executeReturn" type="xsd:string"/>
      </schema>
   </wsdl:types>
   <wsdl:message name="executeResponse">
      <wsdl:part element="impl:executeReturn" name="executeReturn"/>
   </wsdl:message>
   <wsdl:message name="executeRequest">
      <wsdl:part element="impl:execute" name="part"/>
   </wsdl:message>
   <wsdl:portType name="ServiceController">
      <wsdl:operation name="execute">
         <wsdl:input message="impl:executeRequest" name="executeRequest"/>
         <wsdl:output message="impl:executeResponse" name="executeResponse"/>
      </wsdl:operation>
   </wsdl:portType>
   <wsdl:binding name="CFGServicesControllerSoapBinding" type="impl:ServiceController">
      <wsdlsoap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
      <wsdl:operation name="execute">
         <wsdlsoap:operation soapAction=""/>
         <wsdl:input name="executeRequest">
            <wsdlsoap:body use="literal"/>
         </wsdl:input>
         <wsdl:output name="executeResponse">
            <wsdlsoap:body use="literal"/>
         </wsdl:output>
      </wsdl:operation>
   </wsdl:binding>
   <wsdl:service name="ServiceControllerService">
      <wsdl:port binding="impl:CFGServicesControllerSoapBinding" name="CFGServicesController">
         <wsdlsoap:address location="http://vet01iaappservices/FeeRebates/services/CFGServicesController"/>
      </wsdl:port>
   </wsdl:service>
</wsdl:definitions>